let x

x = Math.sqrt(9) // квадрат из числа

x = Math.abs(-5) // обсолютное значение

x = Math.round(4.6) // округляет

x = Math.ceil(4.2)  // округляет вверх 5

x = Math.floor(4.9)  // округляет вниз 4

x = Math.pow(2, 3) // возведение в степень

x = Math.max(3,6,2,8,9) // возвращает большее

x = Math.min(3,6,2,8,9) // возвращает меньшее

x = Math.random() // возврашает случайное число между 0 и 1

x = Math.floor(Math.random() * 10 + 1); // возврашает случайное число между 0 и 10



console.log(x)